Revit 2026 API

# ConnectorFlow Property

---

The flow of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Flow { get; }
```
```vb
Public ReadOnly Property Flow As Double
	Get
```
```cpp
public:
property double Flow {
	double get ();
}
```
```fsharp
member Flow : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This connector does not support flow calculation and associated properties. |

Instantaneous flow at this connector, calculated according to system.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace